## Plan output

```
module.microservice.module.secrets.data.aws_caller_identity.identity: Reading...
module.logging.module.s3.aws_s3_bucket_server_side_encryption_configuration.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_versioning.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_ownership_controls.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_policy.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_lifecycle_configuration.main[0]: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.backend.aws_s3_bucket_lifecycle_configuration.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.logging.aws_s3_bucket_object_lock_configuration.lock["this"]: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_public_access_block.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.microservice.module.secrets.data.aws_caller_identity.identity: Read complete after 1s [id=891377151751]
module.microservice.module.worker.data.aws_partition.current: Reading...
module.microservice.module.worker.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.database.data.aws_partition.current: Reading...
module.microservice.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.hosted_zones.aws_route53_zone.this["document_transfer"]: Refreshing state... [id=Z02064831UC6N7D03DSNG]
module.microservice.module.database.data.aws_caller_identity.identity: Reading...
module.bastion.data.aws_caller_identity.identity: Reading...
module.microservice.module.service.aws_iam_role.task: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-task]
module.microservice.module.worker.data.aws_region.current: Reading...
module.microservice.module.worker.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.worker.module.otel_config.aws_ssm_parameter.this[0]: Refreshing state... [id=/illinois-getchildcare/staging/doc-transfer-worker/otel]
module.microservice.module.database.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.backend.data.aws_partition.current: Reading...
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c4c542a315b431d2]
module.bastion.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.microservice.module.worker.aws_iam_role.task: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker-task]
module.microservice.module.service.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:cluster/illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.aws_acm_certificate.endpoint["this"]: Refreshing state... [id=arn:aws:acm:us-east-1:891377151751:certificate/8ac88d33-64f4-45c5-bc82-610cf16b1a70]
module.microservice.module.database.module.database.data.aws_partition.current: Reading...
module.microservice.module.database.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.worker.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:cluster/illinois-getchildcare-staging-doc-transfer-worker]
module.microservice.module.secrets.data.aws_partition.current: Reading...
module.microservice.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.service.module.alb["this"].data.aws_partition.current: Reading...
module.microservice.module.service.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.service.data.aws_partition.current: Reading...
module.microservice.module.service.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.microservice.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.microservice.module.service.module.otel_config.aws_ssm_parameter.this[0]: Refreshing state... [id=/illinois-getchildcare/staging/document-transfer/otel]
module.backend.aws_s3_bucket.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.microservice.module.secrets.data.aws_region.current: Reading...
module.microservice.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.service.data.aws_caller_identity.identity: Reading...
module.microservice.module.service.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.data.aws_availability_zones.available: Reading...
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.bastion.data.aws_ami.bastion: Reading...
module.logging.data.aws_lambda_functions.all: Reading...
module.bastion.data.aws_partition.current: Reading...
module.bastion.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.database.data.aws_region.current: Reading...
module.microservice.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.service.data.aws_route53_zone.domain["this"]: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.worker.data.aws_caller_identity.identity: Reading...
module.microservice.module.service.data.aws_region.current: Reading...
module.microservice.module.service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.microservice.module.worker.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.service.module.ecr["this"].data.aws_partition.current: Reading...
module.microservice.module.service.module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.data.aws_caller_identity.identity: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=891377151751]
module.microservice.module.worker.aws_iam_role.execution: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker-execution]
module.backend.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.microservice.data.aws_lambda_functions.all: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.microservice.module.service.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z02064831UC6N7D03DSNG]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.microservice.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.microservice.module.service.aws_iam_role.execution: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-execution]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.logging.data.aws_region.current: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_region.current: Reading...
module.bastion.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.microservice.module.service.module.ecr["this"].data.aws_caller_identity.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.microservice.module.service.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.microservice.module.database.module.database.aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20240719181814988100000001]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.microservice.module.secrets.aws_kms_key.secrets: Refreshing state... [id=2a8b7a60-70dc-4812-b0c2-ea121056ef55]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.microservice.module.worker.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.microservice.module.database.aws_kms_key.database: Refreshing state... [id=c44eda7e-7b5d-43b1-977e-f4d7e580e0db]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.microservice.module.service.aws_kms_key.fargate: Refreshing state... [id=d654dd34-e8d2-4218-ab18-512c5c6bcee4]
module.microservice.module.worker.aws_kms_key.fargate: Refreshing state... [id=2c1ab5d7-6ad2-45d3-854f-52b71401de48]
module.microservice.module.service.aws_route53_record.endpoint_validation["staging.document-transfer.cfa.codes"]: Refreshing state... [id=Z02064831UC6N7D03DSNG__1614a409f9459d5606d9aec8c0d3cee6.staging.document-transfer.cfa.codes._CNAME]
module.backend.aws_s3_bucket_versioning.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.bastion.data.aws_ami.bastion: Read complete after 1s [id=ami-071226ecf16aa7d96]
module.backend.aws_s3_bucket_policy.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_kms_key.backend: Refreshing state... [id=e12d42f7-5c01-4df2-8f70-8647f8e51d7e]
module.logging.aws_kms_key.logs: Refreshing state... [id=c9834240-1993-4623-9c60-ab21bd6a7269]
module.bastion.aws_kms_key.this: Refreshing state... [id=aa8437fc-f46d-49ac-99a2-1c0b0bbddfd6]
module.vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20240605160034316400000002]
module.microservice.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.microservice.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=475677258]
module.backend.aws_s3_bucket_logging.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.microservice.data.aws_lambda_function.datadog["this"]: Reading...
module.microservice.module.database.module.database.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20240719181814988100000001-20240719181815513000000003]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-09c173bedb5ad4f50]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0506da06c23d3d9fe]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02414c145b73a1bf2]
module.microservice.module.service.aws_acm_certificate_validation.endpoint["this"]: Refreshing state... [id=2024-05-20 16:37:42.638 +0000 UTC]
module.microservice.module.worker.aws_kms_alias.fargate: Refreshing state... [id=alias/illinois-getchildcare/staging/doc-transfer-worker]
module.microservice.module.database.aws_kms_alias.database: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer/database]
module.microservice.module.service.aws_kms_alias.fargate: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer]
module.microservice.module.secrets.aws_kms_alias.secrets: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer/secrets]
module.vpc.aws_vpc_peering_connection.peer["aptible"]: Refreshing state... [id=pcx-0abf9e62533f46ca6]
module.backend.aws_kms_alias.backend: Refreshing state... [id=alias/illinois-getchildcare/staging/backend]
module.backend.aws_dynamodb_table.tfstate_lock: Refreshing state... [id=staging.tfstate]
module.backend.aws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.logging.aws_kms_alias.logs: Refreshing state... [id=alias/illinois-getchildcare/staging/logs]
module.bastion.aws_kms_alias.this: Refreshing state... [id=alias/illinois-getchildcare/staging/bastion]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f986d198dd3b9e9d]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02d9a8f3d11eef94a]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0189f0a7ed9c8b1c0]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-07da01fd14c162f79]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08ef5814b92528122]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ebea172f63ea7b36]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06a12308bde60f4c3]
module.microservice.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03214fcd109cf3286]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d07fbe3b003de612]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02709b47cad88a398]
module.microservice.aws_cloudwatch_log_subscription_filter.datadog["doc-transfer-worker"]: Refreshing state... [id=cwlsf-2329394860]
module.microservice.aws_cloudwatch_log_subscription_filter.datadog["document-transfer"]: Refreshing state... [id=cwlsf-795611691]
module.microservice.module.service.module.ecr["this"].aws_ecr_repository.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.vpc.module.endpoints.aws_security_group.this[0]: Refreshing state... [id=sg-069644483204bfc34]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08ef5814b925281221080289494]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-089e988da8648dca5]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0671e05dfe5d637b6]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04a5bc60ca5294ada]
module.microservice.data.aws_subnets.private: Reading...
module.microservice.data.aws_subnets.public: Reading...
module.microservice.module.secrets.module.secrets_manager["consumer/aws"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/consumer/aws-20240807163341433400000001-r80x0h]
module.microservice.module.secrets.module.secrets_manager["onedrive"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.microservice.data.aws_subnets.private: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.microservice.data.aws_subnets.public: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07ff470ee8fb30a9c]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0744247f7fe9939f3]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01b22b1c9cb36ddbf]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 0s [id=us-east-1]
module.vpc.module.endpoints.aws_security_group_rule.this["ingress_https"]: Refreshing state... [id=sgrule-4172651141]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.microservice.module.service.module.ecr["this"].aws_ecr_repository_policy.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 0s [id=us-east-1]
module.microservice.module.service.module.ecr["this"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 0s [id=us-east-1]
module.microservice.data.aws_subnet.private["subnet-07da01fd14c162f79"]: Reading...
module.microservice.data.aws_subnet.private["subnet-0189f0a7ed9c8b1c0"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 0s [id=us-east-1]
module.microservice.data.aws_subnet.private["subnet-02d9a8f3d11eef94a"]: Reading...
module.microservice.module.secrets.module.secrets_manager["onedrive"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8|terraform-20240826174250995600000003]
module.microservice.module.secrets.module.secrets_manager["consumer/aws"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/consumer/aws-20240807163341433400000001-r80x0h|terraform-20240807163341709200000003]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.microservice.module.worker.data.aws_vpc.current: Reading...
module.bastion.module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0d024041e938721e6]
module.microservice.data.aws_subnet.private["subnet-07da01fd14c162f79"]: Read complete after 0s [id=subnet-07da01fd14c162f79]
module.microservice.module.service.data.aws_vpc.current: Reading...
module.microservice.module.worker.aws_cloudwatch_log_group.service: Refreshing state... [id=/aws/ecs/illinois-getchildcare/staging/doc-transfer-worker]
module.microservice.module.service.aws_cloudwatch_log_group.service: Refreshing state... [id=/aws/ecs/illinois-getchildcare/staging/document-transfer]
module.vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0c4c542a315b431d2]
module.microservice.data.aws_subnet.private["subnet-0189f0a7ed9c8b1c0"]: Read complete after 0s [id=subnet-0189f0a7ed9c8b1c0]
module.microservice.data.aws_subnet.private["subnet-02d9a8f3d11eef94a"]: Read complete after 0s [id=subnet-02d9a8f3d11eef94a]
module.vpc.aws_route.peer["aptible-rtb-0d07fbe3b003de612"]: Refreshing state... [id=r-rtb-0d07fbe3b003de612368033544]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0c71017a2af6cf86a]
module.bastion.random_shuffle.subnet: Refreshing state... [id=-]
module.microservice.module.service.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-document-transfer-execution]
module.microservice.module.worker.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-01e4acea900d38f64]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-061adafc3727e46a2]
module.microservice.module.service.module.alb["this"].aws_lb_target_group.this["endpoint"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:targetgroup/il-gcc-staging-doc-trans-app/fad70920cdce164a]
module.microservice.module.database.module.database.aws_security_group.this[0]: Refreshing state... [id=sg-0ab438c6ebcfe626e]
module.microservice.module.service.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-06ecd1480c288ef2b]
module.microservice.module.service.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0a66151b2382a2108]
module.microservice.module.service.module.alb["this"].aws_security_group.this[0]: Refreshing state... [id=sg-0771f8e6767f397d5]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d07fbe3b003de6121080289494]
module.bastion.aws_instance.this: Refreshing state... [id=i-03c8d3f0af8dfd73f]
module.vpc.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-05cc1353d14664da7]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2201565842]
module.bastion.module.security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4151066003]
module.microservice.module.database.module.database.aws_db_subnet_group.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.worker.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2419688183]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.microservice.module.worker.data.aws_vpc.current: Read complete after 1s [id=vpc-0c4c542a315b431d2]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.microservice.module.service.data.aws_vpc.current: Read complete after 1s [id=vpc-0c4c542a315b431d2]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::891377151751:policy/vpc-flow-log-to-cloudwatch-20240605160034315600000001]
module.microservice.module.database.module.database.aws_security_group_rule.this["ingress"]: Refreshing state... [id=sgrule-931016090]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.microservice.module.worker.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-doc-transfer-worker-execution]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.microservice.module.service.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1770175940]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]
module.microservice.module.worker.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1891798500]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3831811513]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-4192439624]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-40105728]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1972381386]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4065028013]
module.microservice.module.service.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1269108624]
module.microservice.module.service.module.alb["this"].aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:loadbalancer/app/il-gcc-staging-doc-trans/2cb48b79633f6298]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1670266217]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssmmessages"]: Refreshing state... [id=vpce-038d55d2906b26bf0]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2"]: Refreshing state... [id=vpce-09dd677477a50e117]
module.vpc.module.endpoints.aws_vpc_endpoint.this["s3"]: Refreshing state... [id=vpce-06fe221fedf7a8bf2]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.api"]: Refreshing state... [id=vpce-0664fdd4999c62b98]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-incidents"]: Refreshing state... [id=vpce-07227d23093c910c6]
module.vpc.module.endpoints.aws_vpc_endpoint.this["guardduty-data"]: Refreshing state... [id=vpce-0e4febb651c64bbf7]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm"]: Refreshing state... [id=vpce-0013a4b0521c3e0eb]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2messages"]: Refreshing state... [id=vpce-01cd78c1ead4518ae]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-contacts"]: Refreshing state... [id=vpce-0e4802fab0b2f69a8]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.dkr"]: Refreshing state... [id=vpce-0093f9b18e02d2a5f]
module.vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20240605160034316400000002-20240605160034869200000003]
module.microservice.module.service.module.alb["this"].aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:listener/app/il-gcc-staging-doc-trans/2cb48b79633f6298/470d149962ca870a]
module.microservice.module.service.module.alb["this"].aws_lb_listener.this["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:listener/app/il-gcc-staging-doc-trans/2cb48b79633f6298/73646a3eca8caaac]
module.microservice.module.database.module.database.aws_rds_cluster.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.aws_route53_record.endpoint["this"]: Refreshing state... [id=Z02064831UC6N7D03DSNG_staging.document-transfer.cfa.codes_A]
module.microservice.module.service.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-document-transfer-secrets-access-20240624154936964800000002]
module.microservice.module.database.module.database.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:rds!cluster-25551131-8b26-4ab3-af6c-216812369c2b-3RXwjx]
module.microservice.module.worker.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-doc-transfer-worker-secrets-access-20240909164643976400000003]
module.microservice.module.database.module.database.aws_rds_cluster_instance.this["two"]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-two]
module.microservice.module.database.module.database.aws_rds_cluster_instance.this["one"]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-one]
module.microservice.module.worker.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker]
module.microservice.module.service.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.worker.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-doc-transfer-worker/illinois-getchildcare-staging-doc-transfer-worker]
module.microservice.module.service.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-document-transfer/illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...
module.microservice.module.service.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...
module.microservice.module.worker.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...
module.microservice.module.worker.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.backend.aws_dynamodb_table.tfstate_lock will be updated in-place
  ~ resource "aws_dynamodb_table" "tfstate_lock" {
      - deletion_protection_enabled = true -> null
        id                          = "staging.tfstate"
        name                        = "staging.tfstate"
      ~ tags                        = {
          - "use" = "infrastructure-state" -> null
        }
      ~ tags_all                    = {
          - "use"         = "infrastructure-state" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_kms_key.backend will be updated in-place
  ~ resource "aws_kms_key" "backend" {
        id                                 = "e12d42f7-5c01-4df2-8f70-8647f8e51d7e"
      ~ tags                               = {
          - "use" = "infrastructure-state" -> null
        }
      ~ tags_all                           = {
          - "use"         = "infrastructure-state" -> null
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.backend.aws_s3_bucket.tfstate will be updated in-place
  ~ resource "aws_s3_bucket" "tfstate" {
        id                          = "illinois-getchildcare-staging-tfstate"
      ~ tags                        = {
          - "use" = "infrastructure-state" -> null
        }
      ~ tags_all                    = {
          - "use"         = "infrastructure-state" -> null
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.backend.aws_s3_bucket_lifecycle_configuration.tfstate will be destroyed
  # (because aws_s3_bucket_lifecycle_configuration.tfstate is not in configuration)
  - resource "aws_s3_bucket_lifecycle_configuration" "tfstate" {
      - bucket                                 = "illinois-getchildcare-staging-tfstate" -> null
      - id                                     = "illinois-getchildcare-staging-tfstate" -> null
      - transition_default_minimum_object_size = "all_storage_classes_128K" -> null

      - rule {
          - id     = "state" -> null
          - status = "Enabled" -> null

          - abort_incomplete_multipart_upload {
              - days_after_initiation = 7 -> null
            }

          - filter {
            }

          - noncurrent_version_expiration {
              - noncurrent_days = 30 -> null
            }
        }
    }

  # module.backend.aws_s3_bucket_policy.tfstate will be updated in-place
  ~ resource "aws_s3_bucket_policy" "tfstate" {
        id     = "illinois-getchildcare-staging-tfstate"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = "*" -> {
                          + Service = "config.amazonaws.com"
                        }
                        # (5 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.bastion.aws_instance.this must be replaced
+/- resource "aws_instance" "this" {
      ~ ami                                  = "ami-08b5b3a93ed654d19" -> "ami-071226ecf16aa7d96" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:891377151751:instance/i-03c8d3f0af8dfd73f" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-03c8d3f0af8dfd73f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0b4bfad87e0ef1edc" -> (known after apply)
      ~ private_dns                          = "ip-10-0-22-95.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.22.95" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name"    = "illinois-getchildcare-staging-bastion"
            "service" = "bastion"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (12 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ cpu_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ enclave_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ ephemeral_block_device {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ instance_market_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ maintenance_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ metadata_options {
          ~ http_put_response_hop_limit = 2 -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ network_interface {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ private_dns_name_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-008a2e3956717fd62" -> (known after apply)
          ~ volume_type           = "gp3" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.logging.aws_kms_key.logs will be updated in-place
  ~ resource "aws_kms_key" "logs" {
        id                                 = "c9834240-1993-4623-9c60-ab21bd6a7269"
      ~ tags                               = {
          - "use" = "logging" -> null
        }
      ~ tags_all                           = {
          - "use"         = "logging" -> null
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.logging.aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "illinois-getchildcare-staging-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "application" = "illinois-getchildcare-staging"
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "tofu"        = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.logging.aws_s3_bucket_object_lock_configuration.lock["this"] will be destroyed
  # (because aws_s3_bucket_object_lock_configuration.lock is not in configuration)
  - resource "aws_s3_bucket_object_lock_configuration" "lock" {
      - bucket              = "illinois-getchildcare-staging-logs" -> null
      - id                  = "illinois-getchildcare-staging-logs" -> null
      - object_lock_enabled = "Enabled" -> null

      - rule {
          - default_retention {
              - days  = 30 -> null
              - mode  = "GOVERNANCE" -> null
              - years = 0 -> null
            }
        }
    }

  # module.logging.aws_s3_bucket_ownership_controls.example will be created
  + resource "aws_s3_bucket_ownership_controls" "example" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.logging.aws_s3_bucket_policy.logs will be created
  + resource "aws_s3_bucket_policy" "logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.logging.aws_s3_bucket_public_access_block.good_example will be created
  + resource "aws_s3_bucket_public_access_block" "good_example" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.logging.aws_s3_bucket_server_side_encryption_configuration.logs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.logging.aws_s3_bucket_versioning.logs will be created
  + resource "aws_s3_bucket_versioning" "logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.logging.module.s3.aws_s3_bucket.main will be destroyed
  # (because aws_s3_bucket.main is not in configuration)
  - resource "aws_s3_bucket" "main" {
      - arn                         = "arn:aws:s3:::illinois-getchildcare-staging-logs" -> null
      - bucket                      = "illinois-getchildcare-staging-logs" -> null
      - bucket_domain_name          = "illinois-getchildcare-staging-logs.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "illinois-getchildcare-staging-logs.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "illinois-getchildcare-staging-logs" -> null
      - object_lock_enabled         = true -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetBucketLocation"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::891377151751:root"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs"
                      - Sid       = "DefaultS3BucketPolicyStatement"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::illinois-getchildcare-staging-logs",
                          - "arn:aws:s3:::illinois-getchildcare-staging-logs/*",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::127311923021:root"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs/AWSLogs/891377151751/*"
                      - Sid       = "AllowLBAccessLogsFromAWS"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - "s3:x-amz-acl" = "bucket-owner-full-control"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "delivery.logs.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs/AWSLogs/891377151751/*"
                      - Sid       = "AWSLogDeliveryWrite"
                    },
                  - {
                      - Action    = "s3:GetBucketAcl"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "delivery.logs.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs"
                      - Sid       = "AWSLogDeliveryAclCheck"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "logging.s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs/*"
                      - Sid       = "AllowS3AccessLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "use" = "logging"
        } -> null
      - tags_all                    = {
          - "application" = "illinois-getchildcare-staging"
          - "environment" = "staging"
          - "project"     = "illinois-getchildcare"
          - "tofu"        = "true"
          - "use"         = "logging"
        } -> null

      - grant {
          - id          = "72a8d1e21a0a26b2af8f074638600e3e122a3c706a41a667b4b13ca464c0f86c" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 7 -> null
          - enabled                                = true -> null
          - id                                     = "logs" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 90 -> null
              - expired_object_delete_marker = false -> null
            }

          - noncurrent_version_expiration {
              - days = 30 -> null
            }

          - transition {
              - days          = 30 -> null
              - storage_class = "STANDARD_IA" -> null
            }
        }

      - object_lock_configuration {
          - object_lock_enabled = "Enabled" -> null

          - rule {
              - default_retention {
                  - days  = 30 -> null
                  - mode  = "GOVERNANCE" -> null
                  - years = 0 -> null
                }
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = true -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.logging.module.s3.aws_s3_bucket_lifecycle_configuration.main[0] will be destroyed
  # (because aws_s3_bucket_lifecycle_configuration.main is not in configuration)
  - resource "aws_s3_bucket_lifecycle_configuration" "main" {
      - bucket                                 = "illinois-getchildcare-staging-logs" -> null
      - id                                     = "illinois-getchildcare-staging-logs" -> null
      - transition_default_minimum_object_size = "all_storage_classes_128K" -> null

      - rule {
          - id     = "logs" -> null
          - status = "Enabled" -> null

          - abort_incomplete_multipart_upload {
              - days_after_initiation = 7 -> null
            }

          - expiration {
              - days                         = 90 -> null
              - expired_object_delete_marker = false -> null
            }

          - filter {
            }

          - noncurrent_version_expiration {
              - noncurrent_days = 30 -> null
            }

          - transition {
              - days          = 30 -> null
              - storage_class = "STANDARD_IA" -> null
            }
        }
    }

  # module.logging.module.s3.aws_s3_bucket_ownership_controls.main will be destroyed
  # (because aws_s3_bucket_ownership_controls.main is not in configuration)
  - resource "aws_s3_bucket_ownership_controls" "main" {
      - bucket = "illinois-getchildcare-staging-logs" -> null
      - id     = "illinois-getchildcare-staging-logs" -> null

      - rule {
          - object_ownership = "ObjectWriter" -> null
        }
    }

  # module.logging.module.s3.aws_s3_bucket_policy.main will be destroyed
  # (because aws_s3_bucket_policy.main is not in configuration)
  - resource "aws_s3_bucket_policy" "main" {
      - bucket = "illinois-getchildcare-staging-logs" -> null
      - id     = "illinois-getchildcare-staging-logs" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetBucketLocation"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::891377151751:root"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs"
                      - Sid       = "DefaultS3BucketPolicyStatement"
                    },
                  - {
                      - Action    = [
                          - "s3:*",
                        ]
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::illinois-getchildcare-staging-logs",
                          - "arn:aws:s3:::illinois-getchildcare-staging-logs/*",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::127311923021:root"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs/AWSLogs/891377151751/*"
                      - Sid       = "AllowLBAccessLogsFromAWS"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - "s3:x-amz-acl" = "bucket-owner-full-control"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "delivery.logs.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs/AWSLogs/891377151751/*"
                      - Sid       = "AWSLogDeliveryWrite"
                    },
                  - {
                      - Action    = "s3:GetBucketAcl"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "delivery.logs.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs"
                      - Sid       = "AWSLogDeliveryAclCheck"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "logging.s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::illinois-getchildcare-staging-logs/*"
                      - Sid       = "AllowS3AccessLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.logging.module.s3.aws_s3_bucket_public_access_block.main will be destroyed
  # (because aws_s3_bucket_public_access_block.main is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "main" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "illinois-getchildcare-staging-logs" -> null
      - id                      = "illinois-getchildcare-staging-logs" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.logging.module.s3.aws_s3_bucket_server_side_encryption_configuration.main will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.main is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      - bucket = "illinois-getchildcare-staging-logs" -> null
      - id     = "illinois-getchildcare-staging-logs" -> null

      - rule {
          - bucket_key_enabled = true -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }

  # module.logging.module.s3.aws_s3_bucket_versioning.main will be destroyed
  # (because aws_s3_bucket_versioning.main is not in configuration)
  - resource "aws_s3_bucket_versioning" "main" {
      - bucket = "illinois-getchildcare-staging-logs" -> null
      - id     = "illinois-getchildcare-staging-logs" -> null

      - versioning_configuration {
          - status = "Enabled" -> null
        }
    }

Plan: 7 to add, 5 to change, 10 to destroy.

Changes to Outputs:
  ~ bastion_instance_id           = "i-03c8d3f0af8dfd73f" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```